@extends('weblayouts.default')
@section('detail-active','active')
@section('content')
<div class="container">
    <h2 align="center" style="padding-top:5vh;padding-bottom:1em ;">ข้อมูลจังหวัดตาก</h2>
    <div class="row">
        <div class="col-12 col-md-6">
            <div class="detail-carousel" style="margin-bottom:2em" data-flickity='{ "percentPosition": false ,"wrapAround": true , "autoPlay": 4000,"pageDots": false, "fade": true ,"fullscreen": true}'>
                    <img class="carousel-cell" src="{{ asset('img/kamkwan.png') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/banner1.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/TAK2.png') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/banner2.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/banner3.jpg') }}" alt="" />
            </div>
                <h3>ประวัติจังหวัด</h3>
            <p class="text-justify">
                    เมืองตาก ในอดีตเป็นเมืองที่มีชาวมอญอยู่ มาก่อน ดังมี หลักฐานศิลปมอญปรากฏอยู่ที่ อำเภอบ้านตากมีประวัติความเป็นมาเก่าแก่ และเป็นหนึ่งในหัวเมืองที่มีอายุขัยเกินกว่าสองพันปีขึ้นไป เมื่อมีการอพยพของ ชนชาติไทยจากลุ่มน้ำแยงซีเกียงตอนใต้ลงมา ตามแนวลำน้ำดง (ลำน้ำสาละวิน) มีพวกหนึ่ง ได้ข้ามลำน้ำสาละวิน ผ่านลุ่มน้ำเมยหรือแม่น้ำต่องยินเข้ามาทางช่องเขาด้าน อำเภอแม่สอดและมาถึงบริเวณที่ปัจจุบันเรียกว่า “เมืองตาก” ผู้นำกลุ่มคนไทยที่อพยพมาตั้งถิ่นฐานที่เมืองตากในยุคนั้น ได้ตั้งตนเป็นกษัตริย์ปกครองสืบทอดต่อเนื่องกันมาจนถึงปี พ.ศ. 560 รัชสมัยพระเจ้าสักดำ ซึ่งเป็นกษัตริย์เมืองตากที่ยิ่งใหญ่มาก มีอาณาเขตที่อยู่ในอำนาจแผ่ไปจนจรดทะเลอันดามันดังมีบันทึกในพงศาวดารเหนือกล่าวว่าในรัชสมัยพระเจ้าสักดำนั้นเมืองตาก มีการค้าขายกับเมืองอินเดียด้วย เมืองตากคงจะเสื่อมลงในช่วงพุทธศตวรรษที่ 10 พระยากาฬวรรณดิสผู้เป็นกษัตริย์เมืองตาก ที่อพยพมาจากตอนใต้ของลุ่มแม่น้ำแยงซีเกียง ได้โยกย้ายไปสร้างราชธานีขึ้นใหม่ที่เมืองละโว้ทางตอนใต้ของเมืองตากลงไปอีก
                    มีบางยุคเมืองตากถูกทอดทิ้ง กลายเป็นเมืองร้างดังในพงศาวดารเหนือได้ กล่าวถึงการเสด็จทางชลมารคของพระนางจามเทวี พระราชธิดากษัตริย์ละโว้ (ระยากาฬวรรณดิส) เพื่อไปปกครองแคว้นหริภุญไชย (ลำพูน) ในราว พ.ศ. 1176 โดยทาง ลำน้ำปิง พระนางจามเทวีขึ้นไปสำรวจบนฝั่งแม่น้ำพบร่องรอยกำแพงเมืองเก่าๆ ถูกทิ้งร้างจึงโปรดให้สร้างเป็นบ้านเมืองใหม่ชื่อว่า “เมืองตาก” ต่อมาเมื่อ พ.ศ. 1805 ขุนสามชนเจ้าเมืองฉอดได้ยกทัพ มาประชิดเมืองตาก
                    ซึ่งเป็นเมืองชายแดนของกรุงสุโขทัย พ่อขุนศรีอินทราทิตย์ทรงจัดกองทัพออกไปรบ โดยมีพระราชโอรสองค์เล็กซึ่งมีพระชนมายุได้ 19 พรรษา ติดตามไปด้วย กองทัพ ทั้งสองฝ่ายปะทะกันที่บริเวณเชิงดอยนอกเมืองตากประมาณกิโลเมตรเศษ ราชโอรสองค์เล็กได้ทรงชนช้าง กับขุนสามชนกระทำยุทธหัตถีกัน ขุนสามชนสู้ไม่ได้แตกพ่ายไป ต่อมาภายหลังทรงพระนามว่า “พ่อขุนรามคำแหงมหาราช” และได้โปรดสร้างเจดีย์ขึ้นเป็นที่ระลึกถึงชัยชนะในการทำยุทธหัตถีครั้งนั้น องค์หนึ่งเป็นศิลปแบบสุโขทัย ซึ่งเจดีย์ยุทธหัตถีนี้อยู่ที่วัดพระบรมธาตุ อำเภอบ้านตาก ห่างจากตัวเมืองไปทางฝั่งตะวันตกของแม่น้ำปิงราว 31 กิโลเมตร ต่อมาในแผ่นดินมหาธรรมราชา ได้ย้ายเมืองตากลงมาทางตอนใต้ตามลำน้ำปิง ไปตั้งอยู่ที่ป่ามะม่วง ฝั่งตะวันตก ของแม่น้ำปิง ซึ่งอยู่ในเขตตำบลป่ามะม่วง อำเภอเมืองตากในปัจจุบันเมืองตากที่ย้ายมาตั้งใหม่นี้มิใช่เมืองหน้าด่าน สำหรับป้องกันกองทัพพม่าที่จะยกเข้ามาทางด่านแม่ละเมาเท่านั้น แต่ยังเป็นเมืองที่กองทัพไทยใช้เป็นที่ชุมนุมพลในเวลา ที่จะยกทัพไปตีเมืองเชียงใหม่อีกด้วย ในรัชสมัยสมเด็จพระนเรศวรมหาราช สมเด็จพระนารายณ์มหาราช และสมเด็จพระเจ้าตากสินมหาราชได้เสด็จมาชุมนุมกองทัพที่เมืองตากนี้ทุก พระองค์
                    โดยเฉพาะสมเด็จพระเจ้าตากสินมหาราช ก่อนที่พระองค์จะขึ้นครองราชสมบัตินั้น พระองค์ได้รับแต่งตั้งจากสมเด็จพระที่นั่งสุริยาอมรินทร ให้เป็นข้าหลวงเชิญท้องตราราชสีห์ ไปชำระความหัวเมืองฝ่ายเหนือและต่อมาได้รับการแต่งตั้งเป็นหลวงยกกระบัตร เมืองตาก ปลัดเมืองตาก พระยาวชิรปราการแล้วปราบดาภิเษกขึ้นเป็นพระเจ้าแผ่นดินโดยลำดับ กล่าวโดยสรุป จังหวัดตากเป็นจังหวัดที่มีความเป็นมาในประวัติศาสตร์ ควรค่าแก่การสนใจ เป็นเมืองที่พระมหากษัตริย์ในอดีตได้เสด็จมาชุมนุมกองทัพที่เมืองตากนี้แล้ว ถึง 4 พระองค์ คือ พ่อขุนรามคำแหงมหาราชทรงชนช้างกับขุนสามชนเจ้าเมืองฉอด สมเด็จพระนเรศวรมหาราชทรงประกาศอิสรภาพ ณ เมืองแครง และทรงยกทัพกลับราชอาณาจักรไทยโดยผ่านดินแดนเมืองตากเป็นแห่งแรก สมเด็จพระนารายณ์มหาราชทรงนำทัพไปตีหัวเมืองฝ่ายเหนือ และได้สร้างวัดพระนารายณ์ที่เชิงสะพานกิตติขจรปัจจุบัน และสมเด็จพระเจ้าตากสินมหาราชเคยได้รับพระบรมราชโองการแต่งตั้งเป็นเจ้า เมืองตาก และครั้งที่ 2 เป็นผู้กอบกู้เอกราชของชาติไทยจากพม่า 
            </p>
            <center>
              <img src="{{ asset('img/map-tak.jpg') }}" width="70%">
            </center>
            <h3>ที่ตั้งและอาณาเขต</h3>
                <p class="text-justify">
                    จังหวัดตากตั้งอยู่ภาคเหนือตอนล่างของประเทศ มีพื้นที่ทั้งหมด 16,406.65 ตารางกิโลเมตร เป็นจังหวัดที่มีขนาดเป็นอันดับ 4 ของประเทศและเป็นอันดับ 2 ของภาคเหนือ ตั้งอยู่ระหว่างเส้นรุ้งที่ 15 องศา 50 ลิปดา 36 ฟิลิปดาเหนือ และเส้นแวงที่ 99 องศา 7 ลิปดา 22 ฟิลิปดาตะวันออก สูงกว่าระดับน้ำทะเล 116.2 เมตร มีระยะทางห่างจากกรุงเทพฯ เป็นระยะทาง 426 กิโลเมตร สภาพภูมิประเทศของจังหวัดตากเป็นพื้นที่ตามแนวเทือกเขา โดยสภาพพื้นที่จะถูกแบ่งออกเป็น 2 ส่วนใหญ่ ๆ โดยมีเทือกเขาถนนธงชัยกั้นกลาง ทำให้ลักษณะภูมิอากาศแตกต่างกันไป เนื่องจากเทือกเขาถนนธงชัยเป็นตัวปะทะมรสุมตะวันตกเฉียงใต้ที่พัดมาจากมหาสมุทรอินเดียและทะเลอันดามัน ทำให้ซีกตะวันออกได้รับความชุ่มชื้นจากลมมรสุมไม่เต็มที่ สภาพแห้งแล้ง ส่วนฝั่งตะวันตกจะได้รับอิทธิพลจากลมมรสุมมากกว่าทำให้ปริมาณฝนตกมีความชุ่มชื้นโดยเฉพาะในที่ที่อยู่ในเขตภูเขา
                </p>
        
        </div>
        <div class="col-12 col-md-6">
          <h3>ระยะทางจากอำเภอเมืองตากไปอำเภอใกล้เคียง</h3>
          <table class="table  table-bordered">
              <thead class="thead-dark">
                <tr>
                  {{-- <th scope="col">ลำดับที่</th> --}}
                  <th scope="col">อำเภอ</th>
                  <th scope="col">ระยะห่าง</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  {{-- <th scope="row">1</th> --}}
                  <td>อำเภอบ้านตาก</td>
                  <td>22 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">2</th> --}}
                  <td>อำเภอวังเจ้า</td>
                  <td>38 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">3</th> --}}
                  <td>อำเภอสามเงา</td>
                  <td>56 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">4</th> --}}
                  <td>อำเภอแม่สอด</td>
                  <td>86 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">5</th> --}}
                  <td>อำเภอแม่ระมาด</td>
                  <td>120 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">6</th> --}}
                  <td>อำเภอพบพระ</td>
                  <td>135 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">7</th> --}}
                  <td>อำเภอท่าสองยาง</td>
                  <td>170 กิโลเมตร</td>
                </tr>
                <tr>
                  {{-- <th scope="row">8</th> --}}
                  <td>อำเภออุ้มผาง</td>
                  <td>251 กิโลเมตร</td>
                </tr>
              </tbody>
          </table>
          <h3>อำเภอต่าง ๆ ในจังหวัดตาก</h3>
          <h5>
            1.อำเภอเมืองตาก
          </h5>
          <p class="text-justify">
            อำเภอเมืองตาก เป็นอำเภอในจังหวัดตาก ศูนย์กลางทางด้านคมนาคม และจุดเชื่อมต่อไปยังอำเภอแม่สอด ศูนย์กลางค้าชายแดนไทย-พม่า อำเภอเมืองตากเดิมชื่อ "เมืองระแหง" อดีตมีชาวมอญอาศัยอยู่มาก่อน ดังมีหลักฐานศิลปะมอญปรากฏอยู่ ตัวเมืองเดิมตั้งอยู่ที่อำเภอบ้านตาก เมืองนี้สร้างขึ้นก่อนสมัยกรุงสุโขทัยเป็นราชธานี ต่อมาเมื่อได้สถาปนากรุงสุโขทัยเป็นราชธานีแล้ว เมืองตากมีฐานะเป็นเมืองหน้าด่านที่สำคัญด้านฝั่งตะวันตก ในสมัยกรุงรัตนโกสินทร์ พระบาทสมเด็จพระพุทธเลิศหล้านภาลัยได้โปรดเกล้าฯ ให้ย้ายตัวเมืองตากจากฝั่งขวาของแม่น้ำปิงมายังฝั่งซ้ายบริเวณตำบลบ้านระแหงจนกระทั่งทุกวันนี้
          </p>
          <h5>
            2.อำเภอบ้านตาก
          </h5>
          <p class="text-justify">
            อำเภอบ้านตาก สันนิษฐานว่าคือตัวเมืองตากเดิม เป็นเมืองหน้าด่านสำหรับป้องกันข้าศึกศัตรูมาแต่ดึกดำบรรพ์ ตั้งอยู่บนดอยเล็กๆ ลูกหนึ่ง ปัจจุบันคือบ้านท่าพระธาตุ หมู่ที่ 3 ตำบลเกาะตะเภา อยู่ทางทิศตะวันตกของแม่น้ำปิง ต่อมาสมัยสมเด็จพระมหาธรรมราชา แห่งกรุงศรีอยุธยา ได้ย้ายเมืองตากจากที่เดิมมาอยู่ที่ตำบลป่ามะม่วง อำเภอเมืองตาก และในสมัยพระบาทสมเด็จพระพุทธเลิศล้านภาลัย แห่งกรุงรัตนโกสินทร์ ได้ย้ายเมืองตากไปอยู่ที่ตำบลระแหง อำเภอเมืองตาก ฝั่งตะวันออกของแม่น้ำปิง ซึ่งเป็นที่ตั้งตัวจังหวัดตากในปัจจุบันนี้
          </p>
          <h5>
            3.อำเภอสามเงา
          </h5>
          <p class="text-justify">
            เดิมชื่อ กิ่งอำเภอท่าปุย แล้วได้เปลี่ยนเป็น กิ่งอำเภอสามเงา ในปี พ.ศ. 2460 ต่อมาก็ยกฐานะเป็น อำเภอสามเงา ในปี พ.ศ. 2501
          </p>
          <h5>
            4.อำเภอแม่ระมาด
          </h5>
            <p class="text-justify">
              อำเภอแม่ระมาด เป็นอำเภอหนึ่งของจังหวัดตาก สันนิษฐานว่า เดิมเป็นหมู่บ้านที่อยู่อาศัยของชาวกะเหรี่ยงมานานกว่า 100 ปี ต่อมามีชาวไทยจากทางภาคเหนือได้พากันอพยพลงมาหาที่ทำกิน และเห็นว่าเป็นแหล่งอุดมสมบูรณ์ จึงได้ตั้งหลักฐานอยู่อาศัยและมีคนอพยพมาอยู่เรื่อย ๆ จนเป็นหมู่บ้านใหญ่ จึงได้ตั้งเป็นตำบลขึ้นกับอำเภอแม่สอด เมื่อหมู่บ้านขยายใหญ่ขึ้นอีก พระอินทรคีรี นายอำเภอแม่สอด ในสมัยนั้น จึงได้ยกฐานะขึ้นเป็นกิ่งอำเภอแม่ระมาด และได้สร้างที่ว่าการกิ่งอำเภอขึ้นที่หมู่ที่ 5 ตำบลแม่ระมาด และแต่งตั้งให้ขุนโสภิตบรรณลักษณ์เป็นปลัดกิ่งอำเภอคนแรก และที่ว่าการอำเภอยังตั้งอยู่ ณ ที่เดิมจนทุกวันนี้
            </p>
            <h5>
              5.อำเภอท่าสองยาง
            </h5>
            <p class="text-justify">
              ท่าสองยาง เป็นอำเภอในจังหวัดตาก ติดชายแดนประเทศพม่า ริมแม่น้ำเมย พื้นที่ส่วนใหญ่เป็นป่าเขาสูงตามแนวทิวเขาถนนธงชัย ประชากรส่วนใหญ่เป็นชาวไทยพื้นราบ ประกอบอาชีพทำไร่ ระยะทางจากอำเภอแม่สอดถึงอำเภอท่าสองยาง ประมาณ 84 กิโลเมตร รวมระยะทางจากตัวอำเภอเมืองตากถึงอำเภอท่าสองยางประมาณ 169 กิโลเมตร
            </p>
            <h5>
              6.อำเภอแม่สอด
            </h5>
            <p class="text-justify">
              แม่สอด (คำเมือง: Lanna-Mae Sot.png; พม่า: မဲဆောက်) เป็นอำเภอหนึ่งทางตอนกลางของจังหวัดตาก ได้รับการจัดตั้งเป็นอำเภอมาตั้งแต่ พ.ศ. 2441 ตัวอำเภออยู่ในที่ราบระหว่างภูเขาระหว่างเทือกเขาถนนธงชัยทิวเขาในฝั่งประเทศไทย อีกส่วนหนึ่งเป็นทิวเขาฝั่งประเทศพม่า อำเภอแม่สอดมีพื้นที่ประมาณ 1,986 ตารางกิโลเมตร ประชากรมีทั้งชาวเขาและคนที่อพยพจากอำเภอเมืองตากเข้าไปตั้งถิ่นฐานอยู่ รวมทั้งชาวพม่าที่มีภรรยาและบุตรเป็นคนไทยด้วย อำเภอแม่สอดอยู่ห่างจากอำเภอเมืองตาก 86 กิโลเมตร
            </p>
            <h5>
              7.อำเภอพบพระ
            </h5>
            <p class="text-justify">
              อำเภอพบพระ เป็นอำเภอหนึ่งของจังหวัดตาก ความสำคัญของอำเภอพบพระในทางภูมิศาสตร์ที่สำคัญก็คือมันเป็นอำเภอที่เป็นต้นกำเนิดของแม่น้ำเมย แม่น้ำพรมแดนสายสำคัญระหว่างไทยกับพม่า
            </p>
            <h5>
              8.อำเภออุ้มผาง
            </h5>
            <p class="text-justify">
              อำเภออุ้มผาง เป็นอำเภอหนึ่งทางตอนใต้ของจังหวัดตาก จัดตั้งขึ้นตามพระราชกฤษฎีกาตั้งอำเภออุ้มผาง พ.ศ. 2502 อันมีผลใช้บังคับตั้งแต่วันที่ 6 พฤษภาคม พ.ศ. 2502 อำเภอนี้ที่มีขนาดพื้นที่มากที่สุดและเป็นอำเภอที่อยู่ห่างไกลจากตัวอำเภอเมืองมากที่สุดในประเทศไทย
            </p>
            <h5>
              9.อำเภอวังเจ้า
            </h5>
            <p class="text-justify">
              ท้องที่อำเภอวังเจ้าเดิมเป็นส่วนหนึ่งของอำเภอเมืองตาก ทางราชการได้แบ่งพื้นที่การปกครองออกมาตั้งเป็น กิ่งอำเภอวังเจ้า ตามประกาศกระทรวงมหาดไทยลงวันที่ 26 มิถุนายน พ.ศ. 2539 โดยมีผลบังคับตั้งแต่วันที่ 15 กรกฎาคม ปีเดียวกันและต่อมาได้มีพระราชกฤษฎีกายกฐานะขึ้นเป็น อำเภอวังเจ้า ตามโครงการอำเภอเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว เนื่องในโอกาสมหามงคลเฉลิมพระชนมพรรษา 80 พรรษา 5 ธันวาคม 2550 ในวันที่ 24 สิงหาคม พ.ศ. 2550 โดยมีผลบังคับในวันที่ 8 กันยายน ปีเดียวกัน
            </p>
          
        </div>
        
    </div>
</div>
@endsection