@extends('weblayouts.default')
@section('detail-active','active')
@section('content')
<div class="container">
    <h2 align="center" style="padding-top:5vh;padding-bottom:1em ;">ข้อมูลจังหวัดตาก</h2>
    <div class="row">
        <div class="col-12 col-md-6">
            <div class="detail-carousel" style="margin-bottom:2em" data-flickity='{ "percentPosition": false ,"wrapAround": true , "autoPlay": 4000,"pageDots": false, "fade": true ,"fullscreen": true}'>
                    <img class="carousel-cell" src="{{ asset('img/1.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/2.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/3.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/1.jpg') }}" alt="" />
                    <img class="carousel-cell" src="{{ asset('img/2.jpg') }}" alt="" />
            </div>
                <h3>ประวัติจังหวัด</h3>
            <p class="text-justify">
                    เมืองตาก ในอดีตเป็นเมืองที่มีชาวมอญอยู่ มาก่อน ดังมี หลักฐานศิลปมอญปรากฏอยู่ที่ อำเภอบ้านตากมีประวัติความเป็นมาเก่าแก่ และเป็นหนึ่งในหัวเมืองที่มีอายุขัยเกินกว่าสองพันปีขึ้นไป เมื่อมีการอพยพของ ชนชาติไทยจากลุ่มน้ำแยงซีเกียงตอนใต้ลงมา ตามแนวลำน้ำดง (ลำน้ำสาละวิน) มีพวกหนึ่ง ได้ข้ามลำน้ำสาละวิน ผ่านลุ่มน้ำเมยหรือแม่น้ำต่องยินเข้ามาทางช่องเขาด้าน อำเภอแม่สอดและมาถึงบริเวณที่ปัจจุบันเรียกว่า “เมืองตาก” ผู้นำกลุ่มคนไทยที่อพยพมาตั้งถิ่นฐานที่เมืองตากในยุคนั้น ได้ตั้งตนเป็นกษัตริย์ปกครองสืบทอดต่อเนื่องกันมาจนถึงปี พ.ศ. 560 รัชสมัยพระเจ้าสักดำ ซึ่งเป็นกษัตริย์เมืองตากที่ยิ่งใหญ่มาก มีอาณาเขตที่อยู่ในอำนาจแผ่ไปจนจรดทะเลอันดามันดังมีบันทึกในพงศาวดารเหนือกล่าวว่าในรัชสมัยพระเจ้าสักดำนั้นเมืองตาก มีการค้าขายกับเมืองอินเดียด้วย เมืองตากคงจะเสื่อมลงในช่วงพุทธศตวรรษที่ 10 พระยากาฬวรรณดิสผู้เป็นกษัตริย์เมืองตาก ที่อพยพมาจากตอนใต้ของลุ่มแม่น้ำแยงซีเกียง ได้โยกย้ายไปสร้างราชธานีขึ้นใหม่ที่เมืองละโว้ทางตอนใต้ของเมืองตากลงไปอีก
                    มีบางยุคเมืองตากถูกทอดทิ้ง กลายเป็นเมืองร้างดังในพงศาวดารเหนือได้ กล่าวถึงการเสด็จทางชลมารคของพระนางจามเทวี พระราชธิดากษัตริย์ละโว้ (ระยากาฬวรรณดิส) เพื่อไปปกครองแคว้นหริภุญไชย (ลำพูน) ในราว พ.ศ. 1176 โดยทาง ลำน้ำปิง พระนางจามเทวีขึ้นไปสำรวจบนฝั่งแม่น้ำพบร่องรอยกำแพงเมืองเก่าๆ ถูกทิ้งร้างจึงโปรดให้สร้างเป็นบ้านเมืองใหม่ชื่อว่า “เมืองตาก” ต่อมาเมื่อ พ.ศ. 1805 ขุนสามชนเจ้าเมืองฉอดได้ยกทัพ มาประชิดเมืองตาก
                    ซึ่งเป็นเมืองชายแดนของกรุงสุโขทัย พ่อขุนศรีอินทราทิตย์ทรงจัดกองทัพออกไปรบ โดยมีพระราชโอรสองค์เล็กซึ่งมีพระชนมายุได้ 19 พรรษา ติดตามไปด้วย กองทัพ ทั้งสองฝ่ายปะทะกันที่บริเวณเชิงดอยนอกเมืองตากประมาณกิโลเมตรเศษ ราชโอรสองค์เล็กได้ทรงชนช้าง กับขุนสามชนกระทำยุทธหัตถีกัน ขุนสามชนสู้ไม่ได้แตกพ่ายไป ต่อมาภายหลังทรงพระนามว่า “พ่อขุนรามคำแหงมหาราช” และได้โปรดสร้างเจดีย์ขึ้นเป็นที่ระลึกถึงชัยชนะในการทำยุทธหัตถีครั้งนั้น องค์หนึ่งเป็นศิลปแบบสุโขทัย ซึ่งเจดีย์ยุทธหัตถีนี้อยู่ที่วัดพระบรมธาตุ อำเภอบ้านตาก ห่างจากตัวเมืองไปทางฝั่งตะวันตกของแม่น้ำปิงราว 31 กิโลเมตร ต่อมาในแผ่นดินมหาธรรมราชา ได้ย้ายเมืองตากลงมาทางตอนใต้ตามลำน้ำปิง ไปตั้งอยู่ที่ป่ามะม่วง ฝั่งตะวันตก ของแม่น้ำปิง ซึ่งอยู่ในเขตตำบลป่ามะม่วง อำเภอเมืองตากในปัจจุบันเมืองตากที่ย้ายมาตั้งใหม่นี้มิใช่เมืองหน้าด่าน สำหรับป้องกันกองทัพพม่าที่จะยกเข้ามาทางด่านแม่ละเมาเท่านั้น แต่ยังเป็นเมืองที่กองทัพไทยใช้เป็นที่ชุมนุมพลในเวลา ที่จะยกทัพไปตีเมืองเชียงใหม่อีกด้วย ในรัชสมัยสมเด็จพระนเรศวรมหาราช สมเด็จพระนารายณ์มหาราช และสมเด็จพระเจ้าตากสินมหาราชได้เสด็จมาชุมนุมกองทัพที่เมืองตากนี้ทุก พระองค์
                    โดยเฉพาะสมเด็จพระเจ้าตากสินมหาราช ก่อนที่พระองค์จะขึ้นครองราชสมบัตินั้น พระองค์ได้รับแต่งตั้งจากสมเด็จพระที่นั่งสุริยาอมรินทร ให้เป็นข้าหลวงเชิญท้องตราราชสีห์ ไปชำระความหัวเมืองฝ่ายเหนือและต่อมาได้รับการแต่งตั้งเป็นหลวงยกกระบัตร เมืองตาก ปลัดเมืองตาก พระยาวชิรปราการแล้วปราบดาภิเษกขึ้นเป็นพระเจ้าแผ่นดินโดยลำดับ กล่าวโดยสรุป จังหวัดตากเป็นจังหวัดที่มีความเป็นมาในประวัติศาสตร์ ควรค่าแก่การสนใจ เป็นเมืองที่พระมหากษัตริย์ในอดีตได้เสด็จมาชุมนุมกองทัพที่เมืองตากนี้แล้ว ถึง 4 พระองค์ คือ พ่อขุนรามคำแหงมหาราชทรงชนช้างกับขุนสามชนเจ้าเมืองฉอด สมเด็จพระนเรศวรมหาราชทรงประกาศอิสรภาพ ณ เมืองแครง และทรงยกทัพกลับราชอาณาจักรไทยโดยผ่านดินแดนเมืองตากเป็นแห่งแรก สมเด็จพระนารายณ์มหาราชทรงนำทัพไปตีหัวเมืองฝ่ายเหนือ และได้สร้างวัดพระนารายณ์ที่เชิงสะพานกิตติขจรปัจจุบัน และสมเด็จพระเจ้าตากสินมหาราชเคยได้รับพระบรมราชโองการแต่งตั้งเป็นเจ้า เมืองตาก และครั้งที่ 2 เป็นผู้กอบกู้เอกราชของชาติไทยจากพม่า 
            </p>
        </div>
        <div class="col-12 col-md-6">
                <h3>ที่ตั้งและอาณาเขต</h3>
                <p class="text-justify">จังหวัดตากตั้งอยู่ภาคเหนือตอนล่างของประเทศ มีพื้นที่ทั้งหมด 16,406.65 ตารางกิโลเมตร เป็นจังหวัดที่มีขนาดเป็นอันดับ 4 ของประเทศและเป็นอันดับ 2 ของภาคเหนือ ตั้งอยู่ระหว่างเส้นรุ้งที่ 15 องศา 50 ลิปดา 36 ฟิลิปดาเหนือ และเส้นแวงที่ 99 องศา 7 ลิปดา 22 ฟิลิปดาตะวันออก สูงกว่าระดับน้ำทะเล 116.2 เมตร มีระยะทางห่างจากกรุงเทพฯ เป็นระยะทาง 426 กิโลเมตร สภาพภูมิประเทศของจังหวัดตากเป็นพื้นที่ตามแนวเทือกเขา โดยสภาพพื้นที่จะถูกแบ่งออกเป็น 2 ส่วนใหญ่ ๆ โดยมีเทือกเขาถนนธงชัยกั้นกลาง ทำให้ลักษณะภูมิอากาศแตกต่างกันไป เนื่องจากเทือกเขาถนนธงชัยเป็นตัวปะทะมรสุมตะวันตกเฉียงใต้ที่พัดมาจากมหาสมุทรอินเดียและทะเลอันดามัน ทำให้ซีกตะวันออกได้รับความชุ่มชื้นจากลมมรสุมไม่เต็มที่ สภาพแห้งแล้ง ส่วนฝั่งตะวันตกจะได้รับอิทธิพลจากลมมรสุมมากกว่าทำให้ปริมาณฝนตกมีความชุ่มชื้นโดยเฉพาะในที่ที่อยู่ในเขตภูเขา
        </p>
        </div>
    </div>
</div>
@endsection